phil971-psr.org
#+title: PHIL 971 - The Principle of Sufficient Reason 
#+date: July 8, 2022
#+author: Colin McLear

*** DONE Spinoza II 
    SCHEDULED: <2022-09-08 Thu>
   :PROPERTIES:
   :EXPORT_HUGO_TAGS:  explanation mind-body paralellism psr spinoza substance
   :EXPORT_FILE_NAME: week3
   :END:

We continue with our discussion of Spinoza, focussing on his arguments in /Ethics/
II concerning the parallel structure of mind and body. One important question
raised here is how to understand the relationship between Spinoza's so-called
"parallelism" (or better: "identity-theory") and his view of the intelligibility
of nature. Is his parallelism a result of his commitment to the intelligibility
of nature, or part of what drives that position?

- [[https://discord.com/channels/1006739669842673674/1015112837447811182][Discussion thread]]
- [[file:static/materials/handouts/spinoza-mind.pdf][Overview of Spinoza on Mind]]
- Notes (Coming soon...)
- Handout (Coming soon...)

**** Readings
- Spinoza: /Ethics/ II
   - Focus on the definitions, axioms, and E2p1-13 up until the excursis starting on p. 125. Resume at E2p28 until the end of bk. II.

**** Recommended 
- Della Rocca: [[file:static/materials/readings/dellarocca-ch3.pdf][/Spinoza/, ch. 3]]
- Della Rocca: "[[file:static/materials/readings/dellarocca-reality.pdf][Interpreting Spinoza: The Real is the Rational]]"
- Garber: "[[file:static/materials/readings/garber-superheroes.pdf][Superheroes in the History of Philosophy: Spinoza, Super-Rationalist]]"
- Garrett: "[[file:static/materials/readings/garrett-necessitarianism.pdf][Spinoza’s Necessitarianism]]"
- Hübner: "[[file:static/materials/readings/hubner-explanation.pdf][Spinoza on the Limits of Explanation]]"
- Hübner: "[[file:static/materials/readings/hubner-parallelism.pdf][Spinoza's Parallelism Doctrine & Metaphysical Sympathy]]"
- Renz: [[file:static/materials/readings/renz-realist-rationalism.pdf][/The Explicability of Experience/, ch. 6]]

