content/assignments/week3.md
+++
title = "Week 3 – Spinoza II: Mind & Intelligibility"
publishDate = 2022-09-08T00:00:00-04:00
tags = ["explanation", "mind-body", "paralellism", "psr", "spinoza", "substance"]
draft = false
weight = -100
author = false
toc = false
type = "post"
+++

We continue with our discussion of Spinoza, focussing on his arguments in _Ethics_
II concerning the parallel structure of mind and body. One important question
raised here is how to understand the relationship between Spinoza&rsquo;s so-called
&ldquo;parallelism&rdquo; (or better: &ldquo;identity-theory&rdquo;) and his view of the intelligibility
of nature. Is his parallelism a result of his commitment to the intelligibility
of nature, or part of what drives that position?

-   [Discussion thread](https://discord.com/channels/1006739669842673674/1015112837447811182)
-   [Overview of Spinoza on Mind](/materials/handouts/spinoza-mind.pdf)
-   Notes (Coming soon...)
-   Handout (Coming soon...)


## Readings {#readings}

-   Spinoza: _Ethics_ II
    -   Focus on the definitions, axioms, and E2p1-13 up until the excursis starting on p. 125. Resume at E2p28 until the end of bk. II.


## Recommended {#recommended}

-   Della Rocca: [_Spinoza_, ch. 3](/materials/readings/dellarocca-ch3.pdf)
-   Della Rocca: &ldquo;[Interpreting Spinoza: The Real is the Rational](/materials/readings/dellarocca-reality.pdf)&rdquo;
-   Garber: &ldquo;[Superheroes in the History of Philosophy: Spinoza, Super-Rationalist](/materials/readings/garber-superheroes.pdf)&rdquo;
-   Garrett: &ldquo;[Spinoza’s Necessitarianism](/materials/readings/garrett-necessitarianism.pdf)&rdquo;
-   Hübner: &ldquo;[Spinoza on the Limits of Explanation](/materials/readings/hubner-explanation.pdf)&rdquo;
-   Hübner: &ldquo;[Spinoza&rsquo;s Parallelism Doctrine &amp; Metaphysical Sympathy](/materials/readings/hubner-parallelism.pdf)&rdquo;
-   Renz: [_The Explicability of Experience_, ch. 6](/materials/readings/renz-realist-rationalism.pdf)
